In [2]:
import requests
import pandas as pd

In [30]:
def get_odata(target_url):
    data = pd.DataFrame()
    while target_url:
        r = requests.get(target_url).json()
        data = data.append(pd.DataFrame(r['value']))
        
        if '@odata.nextLink' in r:
            target_url = r['@odata.nextLink']
        else:
            target_url = None
            
    return data

In [32]:
table_url = "https://odata4.cbs.nl/CBS/82931NED"
target_url = table_url + "/Observations"
data_82931 = get_odata(target_url)

In [ ]:
table_url = "https://odata4.cbs.nl/CBS/83765NED"
target_url = table_url + "/Observations"
data_83765 = get_odata(target_url)

In [34]:
data_82931.head()

   Id  Measure ValueAttribute       Value WijkenEnBuurten
0   0  T001036           None  16829290.0            NL00
1   1     3000           None   8334385.0            NL00
2   2     4000           None   8494905.0            NL00
3   3    10680           None        17.0            NL00
4   4    53050           None        12.0            NL00

In [45]:
data_83765[data_83765.Measure.duplicated()]

            Id  Measure ValueAttribute    Value WijkenEnBuurten
99         103  T001036           None  25286.0          GM1680
100        104     3000           None  12603.0          GM1680
101        105     4000           None  12683.0          GM1680
102        106    10680           None   3572.0          GM1680
103        107    53050           None   2558.0          GM1680
...        ...      ...            ...      ...             ...
37845  1716696   ST0001           None      5.0      BU01935210
37846  1716697   ST0003           None    229.0      BU01935210
37847  1716698  CRI1100           None      0.0      BU01935210
37848  1716699  CRI2000           None      2.0      BU01935210
37849  1716700  CRI3000           None      2.0      BU01935210

[1537747 rows x 5 columns]

In [36]:
data_82931.shape

(1348572, 5)

In [39]:
data_83765.shape

(1537850, 5)

In [35]:
data_83765.head()

   Id  Measure ValueAttribute       Value WijkenEnBuurten
0   0  T001036           None  17081507.0            NL00
1   1     3000           None   8475102.0            NL00
2   2     4000           None   8606405.0            NL00
3   3    10680           None   2781768.0            NL00
4   4    53050           None   2101648.0            NL00

In [27]:
obs_data = data

In [31]:
obs_data.head()

   Id  Measure ValueAttribute       Value WijkenEnBuurten
0   0  T001036           None  16829290.0            NL00
1   1     3000           None   8334385.0            NL00
2   2     4000           None   8494905.0            NL00
3   3    10680           None        17.0            NL00
4   4    53050           None        12.0            NL00

In [29]:
get_odata(table_url)

                    name       kind                    url
0          MeasureGroups  EntitySet          MeasureGroups
1           MeasureCodes  EntitySet           MeasureCodes
2             Dimensions  EntitySet             Dimensions
3  WijkenEnBuurtenGroups  EntitySet  WijkenEnBuurtenGroups
4   WijkenEnBuurtenCodes  EntitySet   WijkenEnBuurtenCodes
5           Observations  EntitySet           Observations
6             Properties  Singleton             Properties

In [16]:
get_odata(table_url)

                    name       kind                    url
0          MeasureGroups  EntitySet          MeasureGroups
1           MeasureCodes  EntitySet           MeasureCodes
2             Dimensions  EntitySet             Dimensions
3  WijkenEnBuurtenGroups  EntitySet  WijkenEnBuurtenGroups
4   WijkenEnBuurtenCodes  EntitySet   WijkenEnBuurtenCodes
5           Observations  EntitySet           Observations
6             Properties  Singleton             Properties

In [17]:
groups = get_odata(table_url + "/MeasureGroups")
codes = get_odata(table_url + "/MeasureCodes")

In [24]:
codes.head()

,Identifier,Index,Title,Description,MeasureGroupId,DataType,Unit,Format,Decimals,PresentationType
0,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute
1,3000,9,Mannen,,T001038,Long,aantal,None,0,Absolute
2,4000,10,Vrouwen,,T001038,Long,aantal,None,0,Absolute
3,10680,12,0 tot 15 jaar,Aantal inwoners dat op 1 januari 0 tot 15 jaar...,10000,Long,aantal,None,0,Absolute
4,53050,13,15 tot 25 jaar,Aantal inwoners dat op 1 januari 15 tot 25 jaa...,10000,Long,aantal,None,0,Absolute

In [21]:
obs_data.head()

   Id  Measure ValueAttribute       Value WijkenEnBuurten
0   0  T001036           None  17081507.0            NL00
1   1     3000           None   8475102.0            NL00
2   2     4000           None   8606405.0            NL00
3   3    10680           None   2781768.0            NL00
4   4    53050           None   2101648.0            NL00

In [22]:
data = pd.merge(obs_data, codes, left_on = "Measure", right_on = "Identifier")
data.head()

,Id,Measure,ValueAttribute,Value,WijkenEnBuurten,Identifier,Index,Title,Description,MeasureGroupId,DataType,Unit,Format,Decimals,PresentationType
0,0,T001036,None,17081507.0,NL00,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute
1,103,T001036,None,25286.0,GM1680,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute
2,206,T001036,None,3545.0,WK168000,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute
3,309,T001036,None,3395.0,BU16800000,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute
4,412,T001036,None,150.0,BU16800009,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute

In [20]:
data = pd.merge(data, groups, left_on = "MeasureGroupId", right_on = "Id")
data.head()

,Id_x,Measure,ValueAttribute,Value,WijkenEnBuurten,Identifier,Index_x,Title_x,Description_x,MeasureGroupId,DataType,Unit,Format,Decimals,PresentationType,Id_y,Index_y,Title_y,Description_y,ParentId
0,0,T001036,None,17081507.0,NL00,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute,M000352,6,Bevolking,De bevolking van Nederland op 1 januari.\r\n\r...,None
1,103,T001036,None,25286.0,GM1680,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute,M000352,6,Bevolking,De bevolking van Nederland op 1 januari.\r\n\r...,None
2,206,T001036,None,3545.0,WK168000,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute,M000352,6,Bevolking,De bevolking van Nederland op 1 januari.\r\n\r...,None
3,309,T001036,None,3395.0,BU16800000,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute,M000352,6,Bevolking,De bevolking van Nederland op 1 januari.\r\n\r...,None
4,412,T001036,None,150.0,BU16800009,T001036,7,Aantal inwoners,,M000352,Long,aantal,None,0,Absolute,M000352,6,Bevolking,De bevolking van Nederland op 1 januari.\r\n\r...,None